rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "2015-12-08 01:48:17.000000"], ["updated_at", "2015-12-08 01:48:17.506394"], ["id", 1]]

  def same_director
    movie = Movie.find(params[:id])
    director_name = movie.director

    if not director_name or director_name.empty?
      flash[:notice] = %Q{'#{movie.title}' has no director info}
      redirect_to movies_path
    else
      @movies = Movie.find_all_by_director director_name
      flash[:notice] = %Q{There are #{@movies.size} movie(s) with "#{director_name}" as director}
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]